package main

import (
	"fmt"
	"testing"
)

func TestCheckAnagram(t *testing.T) {
	var tests = []struct {
		s1, s2 string
		want   bool
	}{
		{"выборность", "обрывность", true},
		{"наместница", "сметанница", true},
		{"пласировка", "распиловка", true},
		{"активация", "кавитация", true},
		{"веселость", "сельсовет", true},
		{"геометрия", "геотермия", true},
		{"дежурство", "дружество", true},
		{"дежурство", "дружыство", false},
		{"законовед", "конезавод", true},
		{"кротовина", "тонировка", true},
		{"лекарство", "стекловар", true},
		{"наместник", "сметанник", true},
		{"даместник", "сметанник", false},
		{"пальтишко", "платьишко", true},
		{"австриец", "царствие", true},
		{"акварель", "кавальер", true},
		{"акварель", "кавльер", false},
		{"апельсин", "спаниель", true},
		{"бактриан", "британка", true},
		{"бактриан", "британкб", false},
		{"волчанка", "лавчонка", true},
		{"гордячка", "грядочка", true},
		{"горчинка", "органчик", true},
		{"двоечник", "неводчик", true},
		{"донкихот", "отходник", true},
		{"заборчик", "образчик", true},
		{"интриган", "нитрагин", true},
		{"истопник", "синоптик", true},
		{"баскетбол", "котлетный бар", false},
		{"собеседование", "воспитание десантника", false},
		{"больница", "блиновица", false},
		{"футбол", "быколов", false},
		{"коньки", "кинокт", false},
	}

	for _, test := range tests {
		testName := fmt.Sprintf("%s, %s", test.s1, test.s2)
		t.Run(testName, func(t *testing.T) {
			res := checkAnagram(test.s1, test.s2)
			if res != test.want {
				t.Errorf("got %v, want %v", res, test.want)
			}
		})
	}
}
